hackathon/src/InformationRegisters/ПоказателиSLAПоОбращениям/ПоказателиSLAПоОбращениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиSLAПоОбращениям</name>
  <resources>
    <name>Реакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовторнаяРеакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/InformationRegisters/ПоказателиSLAПоОбращениям/ManagerModule.bsl
Функция ПолучитьПоказателиSLA(Обращение) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиSLAПоОбращениям.Реакция КАК Реакция,
		|	ПоказателиSLAПоОбращениям.Решение КАК Решение,
		|	ПоказателиSLAПоОбращениям.ПовторнаяРеакция КАК ПовторнаяРеакция
		|ИЗ
		|	РегистрСведений.ПоказателиSLAПоОбращениям КАК ПоказателиSLAПоОбращениям
		|ГДЕ
		|	ПоказателиSLAПоОбращениям.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Реакция, Решение, ПовторнаяРеакция", Число(ВыборкаДетальныеЗаписи.Реакция), Число(ВыборкаДетальныеЗаписи.Решение), Число(ВыборкаДетальныеЗаписи.ПовторнаяРеакция));
	КонецЦикла;
	
КонецФункции
